/*Да се направи програма, която да сериализира и десериализира йерархия от работници във фирма, в бинарен файл. За целта:
Да се създаде структура служител (Employee), който има име (до 100 символа), брой подчинени служители и списък с подчинени служители. Списъкът от подчинени служители трябва да се пази в масив от указатели (тоест в двоен указател) от тип служител, за да може да добавяме други служители като подчинени на текущия. Ако служителят няма подчинени работници, този двоен указател трябва да сочи към NULL. (Насока: създайте първо работниците, после мениджърите и после директора, за да можете да ги добавите. Използвайте динамично заделяне на памет, за да създадете списъците от подчинени).
Да се създаде програма, която създава йерархия от служители (примерно един директор, който има двама мениджъри, всеки мениджър има по трима подчинени) и която сериализира тази йерархия в бинарен файл.
Да се направи втора програма, която да чете данните от бинарния файл и да ги десериализира обратно в йерархия и след това да принтира на екрана данните от йерархията подравнени. Например:
   Име на директор
       Име на мениджър 1
           Име на работник 1 
           Име на работник 2
           Име на работник 3
       Име на мениджър 2
           Име на работник 4
           Име на работник 5
           Име на работник 6*/